In [1]:
print('Hello World!')     # Shift Enter

Hello World!

In [2]:
num1 = 36
num2 = 64
add = num1 + num2
print('Addition is', add)

Addition is 100

In [3]:
type(num1)

int

In [4]:
num = [56, 23, 12, 66, 78, 31, 78, 22, 36]

In [5]:
type(num)

list

In [6]:
num[3]

66

In [7]:
import numpy as np

In [8]:
a = np.array([54, 76,16,49,73,46,31,60])

In [9]:
a

array([54, 76, 16, 49, 73, 46, 31, 60])

In [10]:
a.min()

16

In [11]:
a * 2

array([108, 152,  32,  98, 146,  92,  62, 120])

##### Series

In [12]:
import pandas as pd

In [13]:
s = pd.Series([56, 78, 12, 34, 51, 83, 40, 98])

In [14]:
s

0    56
1    78
2    12
3    34
4    51
5    83
6    40
7    98
dtype: int64

In [15]:
s[3]

34

In [16]:
s[3] = 78

In [17]:
s

0    56
1    78
2    12
3    78
4    51
5    83
6    40
7    98
dtype: int64

##### DataFrame

In [19]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series(['anil','meena','raju','pramod','amod'])
s3 = pd.Series([67.89,  78.89,  60.34,  71.36,  80.31])

In [20]:
df = pd.DataFrame({
    'roll': s1,
    'name': s2,
    'marks': s3
})

In [21]:
df

   roll    name  marks
0     1    anil  67.89
1     2   meena  78.89
2     3    raju  60.34
3     4  pramod  71.36
4     5    amod  80.31

In [22]:
import os
os.getcwd()

'/home/mitu/pcp-2'

In [ ]:
Link       ->    https://mitu.co.in/dataset
Download   ->    student.csv

In [23]:
# read the data
df = pd.read_csv('student.csv')

In [24]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [25]:
df.shape

(10, 5)

In [26]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

##### Slicing

In [29]:
x = df.iloc[2:7, 1:4]

In [30]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [31]:
df.iloc[:, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [32]:
df.iloc[2:7, :]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19

In [33]:
df.iloc[[1,5,7,8], 1:4]

     name class  marks
1    amit    TE  59.77
5  ayesha    BE  49.55
7   amita    BE  68.33
8    amol    TE  56.75

In [34]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [35]:
df[['roll','name','marks']]

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [36]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [37]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [38]:
df['marks'].max()

78.66

In [39]:
df['marks'].min()

49.55

In [40]:
df['marks'].mean()

64.499

In [41]:
df['marks'].sum()

644.9899999999999

In [42]:
df['marks'].median()

64.31

##### Custom Column Operations

In [44]:
df['roll'] + 100

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: roll, dtype: int64

In [45]:
df['roll'] = df['roll'] + 100

In [46]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [47]:
df['marks'] = df['marks'] + 0.45

In [48]:
df

   roll     name class  marks  age
0   101     anil    TE  57.22   22
1   102     amit    TE  60.22   21
2   103   aniket    BE  77.33   19
3   104  ajinkya    TE  70.11   20
4   105     asha    TE  63.73   20
5   106   ayesha    BE  50.00   20
6   107     amar    BE  65.79   19
7   108    amita    BE  68.78   23
8   109     amol    TE  57.20   20
9   110    anmol    BE  79.11   21

In [49]:
df['cgpa'] = df['marks'] / 10 + 0.3521

In [50]:
df

   roll     name class  marks  age    cgpa
0   101     anil    TE  57.22   22  6.0741
1   102     amit    TE  60.22   21  6.3741
2   103   aniket    BE  77.33   19  8.0851
3   104  ajinkya    TE  70.11   20  7.3631
4   105     asha    TE  63.73   20  6.7251
5   106   ayesha    BE  50.00   20  5.3521
6   107     amar    BE  65.79   19  6.9311
7   108    amita    BE  68.78   23  7.2301
8   109     amol    TE  57.20   20  6.0721
9   110    anmol    BE  79.11   21  8.2631

##### Boolean Filtering

In [52]:
df['marks'] >= 60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [53]:
df[df['marks'] >= 60]

   roll     name class  marks  age    cgpa
1   102     amit    TE  60.22   21  6.3741
2   103   aniket    BE  77.33   19  8.0851
3   104  ajinkya    TE  70.11   20  7.3631
4   105     asha    TE  63.73   20  6.7251
6   107     amar    BE  65.79   19  6.9311
7   108    amita    BE  68.78   23  7.2301
9   110    anmol    BE  79.11   21  8.2631

In [54]:
x = df[(df['marks'] >= 60) & (df['class'] == 'BE')]

In [55]:
x

   roll    name class  marks  age    cgpa
2   103  aniket    BE  77.33   19  8.0851
6   107    amar    BE  65.79   19  6.9311
7   108   amita    BE  68.78   23  7.2301
9   110   anmol    BE  79.11   21  8.2631

##### Export the data

In [57]:
x.to_csv('output.csv', index = False)

In [58]:
x.to_html('output.html', index = False)